English/NewWords/NewWords02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2013-05-30 四 00:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 几何</a>
<ul>
<li><a href="#sec-1-1">1.1. 1-9</a></li>
<li><a href="#sec-1-2">1.2. 10-20</a></li>
<li><a href="#sec-1-3">1.3. 十倍数</a></li>
<li><a href="#sec-1-4">1.4. 其它</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 2012年08月30日11:34PM</a>
<ul>
<li><a href="#sec-2-1">2.1. restroom/drill/pack into</a></li>
<li><a href="#rant">2.2. rant/antidote</a></li>
<li><a href="#sec-2-3">2.3. pharmacist/antibiotics/gastrointestinal/distress/john/drench</a></li>
<li><a href="#sec-2-4">2.4. squirt/pimple</a></li>
<li><a href="#sec-2-5">2.5. jack off/cunt</a></li>
<li><a href="#sec-2-6">2.6. hypnotize</a></li>
<li><a href="#sec-2-7">2.7. confound</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 2012年08月31日 8:26PM</a>
<ul>
<li><a href="#sec-3-1">3.1. refund</a></li>
<li><a href="#sec-3-2">3.2. rear-ended</a></li>
<li><a href="#sec-3-3">3.3. cheat on/cheat with/fluster</a></li>
<li><a href="#sec-3-4">3.4. bail on/laxative</a></li>
<li><a href="#sec-3-5">3.5. delude</a></li>
<li><a href="#sec-3-6">3.6. mutter/battery</a></li>
<li><a href="#sec-3-7">3.7. ramen/cockroach</a></li>
<li><a href="#sec-3-8">3.8. escort</a></li>
</ul>
</li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 几何</h2>
<div class="outline-text-2" id="text-1">
<p>
pon 做后缀表X边形<br/>
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 1-9</h3>
<div class="outline-text-3" id="text-1-1">
<p>
tri 三 -&gt; trigon/triangle 三边形<br/>
tetragon 四角形<br/>
penta 五 -&gt; pentagon 五边形<br/>
hexa 六 -&gt; hexagon 六边形<br/>
hepta 七 -&gt; heptagon 七边形<br/>
octa 八 -&gt; octagon 八边形<br/>
enneagon/nonagon 九边形<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 10-20</h3>
<div class="outline-text-3" id="text-1-2">
<p>
后面加上deca表十:<br/>
decagon 十边形<br/>
hendecagon 十一边形<br/>
dodecagon 十二边形<br/>
triskaidecogon 十三边形<br/>
tetradecagon 十四边形<br/>
pentadecagon 十五边形<br/>
hexadecagon 十六边形<br/>
heptadecagon 十七边形<br/>
octadecagon 十八边形<br/>
enneadecagon 十九边形<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 十倍数</h3>
<div class="outline-text-3" id="text-1-3">
<p>
加conta<br/>
icosagon 二十边形<br/>
tricontagon 三十边形<br/>
pentacontagon 四十边形<br/>
hexacontagon 六十边形<br/>
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 其它</h3>
<div class="outline-text-3" id="text-1-4">
<p>
XX-sized polygon<br/>
tetrogon means four-sided polygon<br/>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2012年08月30日11:34PM</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> restroom/drill/pack into</h3>
<div class="outline-text-3" id="text-2-1">
<p>
restroom 休息室,更衣室,厕所/洗手间<br/>
drill (v/n)钻孔,训练 -&gt;tornado drill龙卷风演习<br/>
pack into 挤进&#x2026;里;塞进;挤在一个地方;涌入某个场所<br/>
</p>
<pre class="example">
Today, I had to force myself to take a dump at school, even though I have severe restroom anxiety and shyness. I had finally relaxed enough to go when the tornado drills went off mid-dump, and 46 students and teachers proceeded to pack into the bathroom with me. FML
</pre>
</div>
</div>

<div id="outline-container-rant" class="outline-3">
<h3 id="rant"><a id="sec-2-2" name="sec-2-2"></a><span class="section-number-3">2.2</span> rant/antidote</h3>
<div class="outline-text-3" id="text-rant">
<p>
rant 痛骂/咆哮<br/>
antidote 解药/解毒剂<br/>
</p>
<pre class="example">
Today, while I was at work, a coworker began ranting about his theory that the government is going to create a disease that sterilises everyone, and use the antidote to control the population. I was just trying to take a crap in the stall next to him. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> pharmacist/antibiotics/gastrointestinal/distress/john/drench</h3>
<div class="outline-text-3" id="text-2-3">
<p>
pharmacy 药房/药剂学/制药业-&gt;pharmacology药理学-&gt;pharmacologist药理学家-&gt;pharmaceutical制药的 -&gt;pharmacist药剂师<br/>
pharmaceutical industry 制药工业<br/>
gastro 胃 intestine肠-&gt;intestinal和肠相关的 intestinal cancer 肠癌 intestinal bacteria肠道细菌<br/>
=&gt; gastrointestinal肠胃相关的<br/>
distress 不适/悲痛<br/>
biotic 生物的 -&gt;antibiotic抗生的-&gt;antibiotics抗生素<br/>
john 马桶/厕所 on the john 也有人名John 约翰<br/>
</p>
<pre class="example">
Today, the pharmacist warned me that my antibiotics might cause slight gastrointestinal distress. The fact that I have been on the john for the past 90 minutes drenched in sweat would lead me to believe our definitions of "slight" are a bit different. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> squirt/pimple</h3>
<div class="outline-text-3" id="text-2-4">
<p>
squirt 喷出 -&gt; squirt gun水枪<br/>
pimple 疙瘩<br/>
</p>
<pre class="example">
Today, I bit my boyfriend's neck. I felt something squirt into my mouth. Turns out I had just popped a pimple on his neck. Into my mouth. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> jack off/cunt</h3>
<div class="outline-text-3" id="text-2-5">
<p>
jack off 手淫 = masturbate = wank<br/>
cunt 阴道/淫妇<br/>
</p>
<pre class="example">
Today, I heard my daughter scream at my son through the bathroom door, "Are you jacking off in there or something?" and him scream back at her "Shut up you fucking cunt!" My daughter is 7 and my son is 8. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> hypnotize</h3>
<div class="outline-text-3" id="text-2-6">
<p>
hypnotize 使着迷,施催眠术<br/>
区别:hypothesize假设 hypothetic hypothesis<br/>
</p>
<pre class="example">
Today, I got hypnotized at my school's variety show. Apparently, when asked to do something I enjoy doing, I began to violently hump the floor. FML
</pre>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> confound</h3>
<div class="outline-text-3" id="text-2-7">
<p>
confound (v)混淆,搞混 -&gt;confounded (a)糊涂的,困惑的<br/>
confounding (n)混杂,混淆<br/>
</p>
<pre class="example">
emacsrookie ‏@emacsrookie
@SeyZ_ I would like to show more stuff for the advanced emacs user. Btw I think you confound me with another guy,I never made videos. ;-)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2012年08月31日 8:26PM</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> refund</h3>
<div class="outline-text-3" id="text-3-1">
<p>
take a refund 退款<br/>
</p>
<pre class="example">
Today, I bought some perfume that I thought smelled absolutely amazing. Later, my boyfriend walked in, sniffed, and said, "What smells like bacon?" The bottle cost 83$. They won't take a refund. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> rear-ended</h3>
<div class="outline-text-3" id="text-3-2">
<p>
rear (a)后方,后面 -&gt; rear-ended 追尾<br/>
</p>
<pre class="example">
Today, I got rear-ended. An old woman got out and came over to my car window. I thought she was coming to apologize and trade insurance companies. Instead, she poured her soda on my head, ran back into her car, and drove away. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> cheat on/cheat with/fluster</h3>
<div class="outline-text-3" id="text-3-3">
<p>
cheat on 对&#x2026;不忠<br/>
cheat with 欺骗<br/>
fluster (v/n)慌张,混乱<br/>
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> bail on/laxative</h3>
<div class="outline-text-3" id="text-3-4">
<p>
bail 保释 -&gt; bail on 放弃,失约<br/>
laxative 泻药<br/>
</p>
<pre class="example">
Today, I had to bail on yet another date with an awesome guy. Every time I make a date, my hateful mother slips laxatives into my food so I'm glued to the shitter until 2am. This is the fourth time. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> delude</h3>
<div class="outline-text-3" id="text-3-5">
<p>
delude into 欺骗某人使相信<br/>
</p>
<pre class="example">
The manager deluded her into thinking he would give her the job.
</pre>
<p>
delude oneself into 自欺欺人<br/>
</p>
<pre class="example">
Don't delude yourself into thinking that the prices will ever fall.
</pre>
<pre class="example">
Today, my girlfriend tried to convince me that she never takes dumps. I told her that as long as she eats, it's a biological impossibility, but she seems to have genuinely deluded herself into thinking it's true, purely because she is a girl. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> mutter/battery</h3>
<div class="outline-text-3" id="text-3-6">
<p>
mutter 咕哝<br/>
battery (n)电池,殴打-&gt;assault and battery 人身攻击<br/>
</p>
<pre class="example">
Today, after years of bad blood, my husband decided to invite his parents to dinner. After making rude remarks about my pregnancy, his dad eventually muttered that I'm a slut. My husband punched him, his wife called the police, and now I'm all alone while he sits in a jail cell for battery. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> ramen/cockroach</h3>
<div class="outline-text-3" id="text-3-7">
<p>
ramen 面条<br/>
cockroach 蟑螂<br/>
</p>
<pre class="example">
Today, I ordered ramen to go. I looked at my order and discovered a cockroach. Disgusted, I showed it to them, and they apologized by "replacing" it for free. Later on, while I was enjoying the delicious food, I once again discovered a cockroach buried under all the noodles. FML
</pre>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> escort</h3>
<div class="outline-text-3" id="text-3-8">
<p>
escort (n)陪同,护航舰,护卫队(v)护送,陪同<br/>
</p>
<pre class="example">
Today, I was fired from my job. My boss turned to everyone and said, "Allow me to escort this trash out of the office." Everyone cheered. FML
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
